trunk_colors = [
    ["#4A2E1D", "#3E2C23"],     # 深咖啡 + 黑棕
    ["#5B3921", "#7A4F2B"],     # 赤褐色 + 砖棕
    ["#3B2F2F", "#2E1F1F"],     # 冷棕 + 深栗色
    ["#6B4226", "#8B5A2B"],     # 古铜棕 + 浅铜棕
    ["#362A1F", "#4D3A2A"]      # 焦糖棕 + 浅土棕
]


leaves_colors = [
    ["#7DA08B", "#A0C1A1", "#61876E"],   # 青绿调：日式温柔绿
    ["#96B38A", "#BBD0A3", "#6F8F5E"],   # 苔藓绿 + 玉露绿
    ["#8EA79F", "#B4CCC4", "#6C918A"],   # 低饱和蓝绿调
    ["#7F9971", "#A6BF94", "#5F7D55"],   # 淡抹绿意调
    ["#8CAFA3", "#B7D0C3", "#6A8C82"],    # 水墨青绿系
    ["#DDAA44", "#F2C94C", "#E6B25C"],   # 金黄枫叶风
    ["#E66A2B", "#F2994A", "#C75D27"],   # 深橘红枫调
    ["#B84A39", "#D8775A", "#F2A07B"],   # 红枫 + 落日橙
    ["#A76F35", "#C28D52", "#E5B97C"],   # 落叶黄棕系
    ["#A83226", "#CC5A5A", "#F28484"],    # 枫红 + 淡胭脂红
    ["#A59ACA", "#C1B6E0", "#837BB0"],   # 薰衣草紫
    ["#8FA1C7", "#B3C1E1", "#6F85A9"],   # 冰蓝紫调
    ["#A297BD", "#C5B6DD", "#7C6C9F"],   # 紫藤 + 烟紫
    ["#9AB2B5", "#BDD9DD", "#6C8D91"],   # 冷调蓝绿过渡
    ["#7C8BA1", "#A9B4C9", "#596E88"]    # 雾蓝 + 雾灰
]

plant_pot_colors = [
    ["#c3c3c3"],  # 中性灰
    ["#a8a8a8"],  # 灰中带暖
    ["#d6d6d6"],  # 更亮一些
    ["#bdbdbd"],  # 偏柔和灰
    ["#e1e1e1"]
]
